_Rarzrabotki/Rarus/USO2/Reports/УСОERP_ОбъемноКалендарныйПланГрафик_НовыйВариант.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Report>
		<Properties>
			<Name>УСОERP_ОбъемноКалендарныйПланГрафик_НовыйВариант</Name>
		</Properties>
	</Report>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/Периодичность.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>Периодичность</Name>
			<Comment>(Упр)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>День</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неделя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Декада</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Месяц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Квартал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Полугодие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Год</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Reports/УСОERP_ОбъемноКалендарныйПланГрафик_НовыйВариант/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ПолучитьПредставлениеПериодаДляОтчета(ДатаПоГрафику, Периодичность=Неопределено, Заголовок="") Экспорт 
	
	Если Периодичность = Перечисления.Периодичность.Год Тогда 
		ПредставлениеПериода = Формат(ДатаПоГрафику, "ДФ='yyyy ''год'''");
		
	ИначеЕсли Периодичность = Перечисления.Периодичность.Месяц Тогда 
		ПредставлениеПериода = Формат(ДатаПоГрафику, "ДФ='MMM yy ''г.'''");
		
	ИначеЕсли Периодичность = Перечисления.Периодичность.Неделя Тогда 
		ПредставлениеПериода = СтрШаблон("%1 - %2", Формат(НачалоНедели(ДатаПоГрафику), "ДФ=dd.MM"), Формат(КонецНедели(ДатаПоГрафику), "ДФ=dd.MM"));
		
	ИначеЕсли Периодичность = Перечисления.Периодичность.День Тогда 
		ПредставлениеПериода = Формат(ДатаПоГрафику, "ДФ=dd.MM.yy");
		
	Иначе
		ПредставлениеПериода = "Всего";
	КонецЕсли;
	
	Если Заголовок = "" Тогда 
		Возврат ПредставлениеПериода;
		
	Иначе 
		Возврат Заголовок + Символы.ПС + "(" + ПредставлениеПериода + ")";
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецЕсли
